In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [56]:
df = pd.DataFrame(randn(5,4), ['a','b','c','d','e'],
                 ['W','X','Y','Z'])
df

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [5]:
df['W']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: W, dtype: float64

In [8]:
df[['W','Z']]

          W         Z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [9]:
df['new'] = df['W'] + df['Z']

In [11]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [12]:
df.drop('new', axis=1)

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [13]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [14]:
df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [16]:
df.drop('e', axis = 0)

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [17]:
df.shape

(5, 4)

In [24]:
df.loc['c']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: c, dtype: float64

In [25]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: c, dtype: float64

In [26]:
df.loc['b','W']

0.6511179479432686

In [33]:
df.loc[['a','c'],['W','X']]

          W         X
a  2.706850  0.628133
c -2.018168  0.740122

In [34]:
df > 0

       W      X      Y      Z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [35]:
df < 0

       W      X      Y      Z
a  False  False  False  False
b  False   True   True  False
c   True  False  False   True
d  False   True   True  False
e  False  False  False  False

In [36]:
df [df>0]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [38]:
df['W']>0

a     True
b     True
c    False
d     True
e     True
Name: W, dtype: bool

### Conditional Selection

In [39]:
df[df['W']>0]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [44]:
df[df['W']>0]['X']

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: X, dtype: float64

In [46]:
df[df['W']>0][['Y','X']]

          Y         X
a  0.907969  0.628133
b -0.848077 -0.319318
d -0.933237 -0.758872
e  2.605967  1.978757

In [41]:
df[df['Z']<0]

          W         X         Y         Z
c -2.018168  0.740122  0.528813 -0.589001

In [48]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
e  0.190794  1.978757  2.605967  0.683509

In [49]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

### Reset Index

In [50]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [51]:
df.reset_index()

  index         W         X         Y         Z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [52]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [58]:
t = df[:]
t.reset_index(inplace=True)
t

  index         W         X         Y         Z
0     a  0.302665  1.693723 -1.706086 -1.159119
1     b -0.134841  0.390528  0.166905  0.184502
2     c  0.807706  0.072960  0.638787  0.329646
3     d -0.497104 -0.754070 -0.943406  0.484752
4     e -0.116773  1.901755  0.238127  1.996652

In [59]:
new = 'Intel Amazon Google Baidu Apple'.split()
df['company'] = new

In [60]:
df

          W         X         Y         Z company
a  0.302665  1.693723 -1.706086 -1.159119   Intel
b -0.134841  0.390528  0.166905  0.184502  Amazon
c  0.807706  0.072960  0.638787  0.329646  Google
d -0.497104 -0.754070 -0.943406  0.484752   Baidu
e -0.116773  1.901755  0.238127  1.996652   Apple

### Set and Reset Index

In [62]:
df.set_index('company')

                W         X         Y         Z
company
Intel    0.302665  1.693723 -1.706086 -1.159119
Amazon  -0.134841  0.390528  0.166905  0.184502
Google   0.807706  0.072960  0.638787  0.329646
Baidu   -0.497104 -0.754070 -0.943406  0.484752
Apple   -0.116773  1.901755  0.238127  1.996652

In [64]:
df.reset_index()

  index         W         X         Y         Z company
0     a  0.302665  1.693723 -1.706086 -1.159119   Intel
1     b -0.134841  0.390528  0.166905  0.184502  Amazon
2     c  0.807706  0.072960  0.638787  0.329646  Google
3     d -0.497104 -0.754070 -0.943406  0.484752   Baidu
4     e -0.116773  1.901755  0.238127  1.996652   Apple